snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/ЗаданиеНаАгрегацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаАгрегацию</name>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистыСозданы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацииЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНоменклатурыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяКоробка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	//++Данилова Е.В. 04.05.2026 SNL-201
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер,КоличествоКоробок");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер,КоличествоКоробок,Автор");
	//--Данилова Е.В. 04.05.2026 
	МетаданныеОбъекта = ЭтотОбъект.Метаданные();              
	
	УстановитьНезаполненныйРеквизитШапки(ЭтотОбъект,"Автор",ПараметрыСеанса.Пользователь,МетаданныеОбъекта);
	
	Дата = ТекущаяДата();	  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда  
		
		// Кельманов А.В. - HELP-6061 - 2025.08.12 {
		//РеквизитыШапки = ПолучитьРеквизитыШапки(ДанныеЗаполнения, "Номер,Контрагент,Организация", "Документ");	
		РеквизитыШапки = ПолучитьРеквизитыШапки(ДанныеЗаполнения, "Номер,Контрагент,Организация,НомерЗаказа", "Документ");	
		// Кельманов А.В. - HELP-6061 - 2025.08.12 }

		ДокОснование = ДанныеЗаполнения;       
		НомерНакладной = РеквизитыШапки.Номер;   
		ОрганизацияСтрокой = Строка(РеквизитыШапки.Организация);
		КонтрагентСтрокой = Строка(РеквизитыШапки.Контрагент);
		НомерЗаказа = РеквизитыШапки.НомерЗаказа; // Кельманов А.В. - HELP-6061 - 2025.08.12
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)       
	Результат = ПроверитьЗаполнениеПолей(); 
	если не Результат.Успех тогда    
		ТекстОшибки = СтрСоединить(Результат.Ошибки,", ");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	если Модифицированность() тогда
         ОписаниеНоменклатурыСтрокой = СгенерироватьНоменклатурноеОписаниеЗадание();
	КонецЕсли;
	
КонецПроцедуры  


Функция СгенерироватьНоменклатурноеОписаниеЗадание ()
	Запрос=новый запрос;
	запрос.Текст=  "ВЫБРАТЬ различные
	|	ТЧ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура.Код КАК Код
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	запрос.УстановитьПараметр("ТЧ",Товары);  
	возврат СтрСоединить(запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код"),"#");
КонецФункции

  
Функция ПроверитьЗаполнениеПолей ()      
	
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,новый Массив);
	
	если не ЗначениеЗаполнено(ДокОснование) тогда
		СтруктураВозврата.Ошибки.Добавить("Пустое док. основание");
	КонецЕсли;
	//++Данилова Е.В. 27.04.2026 
	Если НЕ ДополнительныеСвойства.Свойство("ПроверятьКороб") 
		ИЛИ ДополнительныеСвойства.ПроверятьКороб Тогда 
		//--Данилова Е.В. 27.04.2026
		если КоличествоКоробок = 0 тогда
			СтруктураВозврата.Ошибки.Добавить("Не заполнено количество коробок");
		КонецЕсли;
		//++Данилова Е.В. 27.04.2026 
	КонецЕсли;
	//--Данилова Е.В. 27.04.2026 
	если товары.Количество() = 0 тогда
		СтруктураВозврата.Ошибки.Добавить("Не заполнена табличная часть товары");
	КонецЕсли;
	если СтруктураВозврата.Ошибки.количество()>0 тогда 
		СтруктураВозврата.Успех = ложь;
	КонецЕсли;                         
	
	Возврат СтруктураВозврата;
	
КонецФункции
